app/controllers/favorites_controller.rb

  def create
    favorite = current_user.favorites.create(post_id: params[:post_id])
---
INSERT INTO "favorites" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["post_id", 6], ["created_at", "2018-06-21 20:32:51.332071"], ["updated_at", "2018-06-21 20:32:51.332071"]]

  def destroy
    favorite = current_user.favorites.find_by(id: params[:id]).destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 1], ["LIMIT", 1]]