app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.image.retrieve_from_cache! params[:cache][:image]
    if @post.save
---
INSERT INTO "posts" ("image", "caption", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "pf_home2.jpg"], ["caption", ""], ["created_at", "2018-06-21 20:08:49.132712"], ["updated_at", "2018-06-21 20:08:49.132712"], ["user_id", 3]]

  def show
    @favorite = current_user.favorites.find_by(post_id: @post.id)
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."post_id" = $2 LIMIT $3  [["user_id", 3], ["post_id", 5], ["LIMIT", 1]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "caption" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["caption", "aaaa"], ["updated_at", "2018-06-21 17:12:54.734321"], ["id", 4]]