app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "icon") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "password_digest" = $1, "icon" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$10$lAvna7D..feIi7OhnCN2u.1sXfIVstioKboybwS2MCbZ/PtmPhbGm"], ["icon", "pf_home4.jpg"], ["updated_at", "2018-06-21 17:51:38.345767"], ["id", 1]]
---
  def update
    @user.update(user_params)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 4]]
---
  def set_favorites
    @favorites = Favorite.where(user_id: @user.id)

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 4]]
---
  def set_post
    @post = Post.where(user_id: params[:id])